In [4]:
import pandas as pd
import numpy as np
import random
import string

* ###Series is just a single column of data

In [5]:
data1 = [i for i in range(10)]
data1

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [6]:
alphalist = list(string.ascii_lowercase)
print(alphalist)

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']

In [7]:
index1 = [alphalist[i] for i in range(10)]
index1

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [8]:
serie1 = pd.Series(data=data1, index = index1)
dict = {k:v for k,v in zip(index1, data1)}
dict

{'a': 0,
 'b': 1,
 'c': 2,
 'd': 3,
 'e': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9}

In [7]:
serie2 = pd.Series(dict)
serie2

0    <class 'dict'>
dtype: object

In [9]:
df = pd.DataFrame(np.random.randn(5,5), index='A/B/C/D/E'.split('/'), columns = 'V/W/X/Y/Z'.split('/'))
df

          V         W         X         Y         Z
A  0.524687 -0.251853  1.432848 -0.388976 -2.483079
B  0.704706 -1.243767  0.541597  0.057903 -0.294835
C -0.157673  0.634408 -0.390278 -1.928218  0.644494
D -0.330391  2.373755  0.236506  0.424190 -0.237649
E  1.447349 -1.477303  1.577187 -1.695920  0.583365

In [11]:
df[['V', 'X']]

          V         X
A -0.949495 -0.170997
B -0.615760 -0.682671
C -2.536376 -2.098263
D -0.393487  0.863977
E  1.082723 -0.408428

In [51]:
# We use iloc to select a particular row

In [10]:
df.iloc[0]

V    0.524687
W   -0.251853
X    1.432848
Y   -0.388976
Z   -2.483079
Name: A, dtype: float64

In [13]:
df.loc['B']['V']

-0.6157600423402655

In [15]:
df[df['W']>0]

Empty DataFrame
Columns: [V, W, X, Y, Z]
Index: []

In [16]:
df['U'] = df['V'] + df['Z']

In [17]:
df

          V         W         X         Y         Z         U
A -0.949495 -0.852218 -0.170997  0.764213 -0.475496 -1.424990
B -0.615760 -1.386661 -0.682671  0.418106 -1.685541 -2.301301
C -2.536376 -0.438288 -2.098263 -1.029803 -0.106972 -2.643347
D -0.393487 -0.303141  0.863977  0.834269 -0.172154 -0.565641
E  1.082723 -0.135073 -0.408428  0.801132 -0.711081  0.371642

In [18]:
df[df['U'] > df['V']]

Empty DataFrame
Columns: [V, W, X, Y, Z, U]
Index: []

In [25]:
df[['W', 'Y']]

          W         Y
A -0.852218  0.764213
B -1.386661  0.418106
C -0.438288 -1.029803
D -0.303141  0.834269
E -0.135073  0.801132

In [26]:
df.iloc[1]['X']

-0.6826705393406886

In [43]:
df.loc['D', 'X'], df.loc['D', 'Z']

(0.8639769481087342, -0.17215377042070817)

In [48]:
df.loc['D'][['X', 'Z']]

X    0.863977
Z   -0.172154
Name: D, dtype: float64

In [49]:
df[['X', 'Z']].iloc[3]

X    0.863977
Z   -0.172154
Name: D, dtype: float64

In [51]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'], 
                    'B':['B0', 'B1', 'B2', 'B3'],
                    'C':['C0', 'C1', 'C2', 'C3']},index=[0,1,2,3])
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A4  B3  C3

In [52]:
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'], 
                    'B':['B4', 'B5', 'B6', 'B7'],
                    'C':['C4', 'C5', 'C6', 'C7']},index=[0,1,2,3])
df2

    A   B   C
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [54]:
z= pd.concat([df1, df2])
z

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A4  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [56]:
y = pd.concat([df1, df2], axis = 1)
y

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A4  B3  C3  A7  B7  C7

#Merging

In [3]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A' : ['A0', 'A1', 'A2', 'A3'],
                     'B' : ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C' : ['C0', 'C1', 'C2', 'C3'],
                      'D' : ['D0', 'D1', 'D2', 'D3']
                     
                     })
pd.merge(left, right, how = "inner", on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [4]:
pd.merge(left, right, how = "outer", on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [21]:
left = pd.DataFrame({'index': ['K0', 'K1', 'K2', 'K3'],
                     'A' : ['A0', 'A1', 'A2', 'A3'],
                     'B' : ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'index': ['K0', 'K1', 'K2', 'K3'],
                      'C' : ['C0', 'C1', 'C2', 'C3'],
                      'D' : ['D0', 'D1', 'D2', 'D3']
                     
                     })

In [28]:
pd.merge(left, right)

  index   A   B   C   D
0    K0  A0  B0  C0  D0
1    K1  A1  B1  C1  D1
2    K2  A2  B2  C2  D2
3    K3  A3  B3  C3  D3

In [27]:
pd.merge(left, right, how="outer")

  index   A   B   C   D
0    K0  A0  B0  C0  D0
1    K1  A1  B1  C1  D1
2    K2  A2  B2  C2  D2
3    K3  A3  B3  C3  D3

In [11]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [12]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [15]:
new_columns = ["NameBank", "City", "State", "Cert", "Acquiring_InstitutionAI", "DateClosing", "Fund"]

In [17]:
df.columns = new_columns

AttributeError: 'list' object has no attribute 'columns'

In [1]:
group_df = df.groupby('State')

NameError: name 'df' is not defined

In [8]:
print(df)

[                         Bank NameBank           CityCity StateSt  CertCert  \
0                    Almena State Bank             Almena      KS     15426
1           First City Bank of Florida  Fort Walton Beach      FL     16748
2                 The First State Bank      Barboursville      WV     14361
3                   Ericson State Bank            Ericson      NE     18265
4     City National Bank of New Jersey             Newark      NJ     21111
..                                 ...                ...     ...       ...
558                 Superior Bank, FSB           Hinsdale      IL     32646
559                Malta National Bank              Malta      OH      6629
560    First Alliance Bank & Trust Co.         Manchester      NH     34264
561  National State Bank of Metropolis         Metropolis      IL      3815
562                   Bank of Honolulu           Honolulu      HI     21029

                 Acquiring InstitutionAI Closing DateClosing  FundFund
0                            Equity Bank    October 23, 2020     10538
1              United Fidelity Bank, fsb    October 16, 2020     10537
2                         MVB Bank, Inc.       April 3, 2020     10536
3             Farmers and Merchants Bank   February 14, 2020     10535
4                        Industrial Bank    November 1, 2019     10534
..                                   ...                 ...       ...
558                Superior Federal, FSB       July 27, 2001      6004
559                    North Valley Bank         May 3, 2001      4648
560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
561              Banterra Bank of Marion   December 14, 2000      4646
562                   Bank of the Orient    October 13, 2000      4645

[563 rows x 7 columns]]

In [20]:
df = pd.DataFrame()

In [21]:
group

Empty DataFrame
Columns: []
Index: []